import {formatMessage} from 'localization';

export const heroData = {
    title: formatMessage('questions.hero.title'),
    thumbnail: '/static/images/questions-hero-bg.jpg',
    thumbnail_mobile: '/static/images/questions-hero-mobile.jpg',
};

export const questionPathsData = [
    {
        id: 1,
        titleId: 'questions.questionPaths.item1',
    },
    {
        id: 2,
        titleId: 'questions.questionPaths.item2',
    },
    {
        id: 3,
        titleId: 'questions.questionPaths.item3',
    },
    {
        id: 4,
        titleId: 'questions.questionPaths.item4',
    },
    {
        id: 5,
        titleId: 'questions.questionPaths.item5',
    },
    {
        id: 6,
        titleId: 'questions.questionPaths.item6',
    },
];

export const faqData = [
    {
        id: 1,
        titleId: 'questions.questionPaths.item1',
        faq: [
            {
                id: 1,
                question: 'چگونه می‌توانم در دوره آموزشی ثبت نام کنم؟',
                answer:
                    'می‌توانید ار بخش دوره ها اطلاعات هر دوره آموزشی را بررسی کنید و در دوره مورد نیازتان ثبت نام کنید.',
            },
            {
                id: 2,
                question: 'برای ورود نیاز به رمز عبور دارم؟',
                answer:
                    'خیر شما پس از ایجاد حساب کاربری در سایت، هر زمانی که اقدام به ورود کنید، پیامکی حاوی کد 4 رقمی برای شما ارسال می‌شود که با وارد کردن آن کد وارد سایت می‌شوید.',
            },
            {
                id: 3,
                question: 'در صورت عدم دریافت پیامک چه کار کنم؟',
                answer:
                    'در ابتدا کمی صبور باشید، معمولا پیامک‌ها در کمتر از 60 ثانیه ارسال می‌شود، ولی چناچه پیامک به شما نرسید کد 4 رقمی برای شما تلگرام نیز می‌شود که از آن طریق هم می‌توانید کد ورود را دریافت کنید.' ,
            },
            {
                id: 4,
                question: 'آیا افراد خارج از ایران هم می‌توانند در دوره‌ها شرکت کنند؟',
                answer:
                    'بله، همه افراد در تمام شهرهای ایران و سایر کشورها می‌توانند در دوره‌ها شرکت کنند.',
            },
        ],
    },
    {
        id: 2,
        titleId: 'questions.questionPaths.item2',
        faq: [
            {
                id: 1,
                question:'از چه طریقی می‌توانم هزینه دوره آموزشی را پرداخت کنم؟\n',
                answer:
                    'در صفحه اختصاصی هر دوره، گزینه ثبت‌نام وجود دارد و می‌توانید به صورت اینترنتی هزینه دوره را پرداخت نمایید.'
            },
        ],
    },
    {
        id: 3,
        titleId: 'questions.questionPaths.item3',
        faq: [
            {
                id: 1,
                question: 'تفاوت دوره "خود آموز" و "گواهینامه‌دار" چیست؟',
                answer:
                "توسط مدرس یا دستیار آموزشی ، رفع اشکال ، ارزیابی پروژه و فرصت ارائه گواهینامه دانشگاه امیرکبیر را نیز دارد."
           },
            {
                id: 2,
                question: 'پس از اتمام مدت پشتیبانی به محتوای آموزشی دسترسی خواهم داشت؟',
                answer:
                     'بله، حتی بعد از پایان دوره پشتیبانی آموزشی دسترسی فراگیر به محتوای آموزشی شامل فیلم ها و تمرینات ، باقی خواهد ماند.'
           },
            {
                id: 3,
                question: ' در صورت به روز رسانی دوره ها آیا این محتوا در اختیار فراگیرانی که قبلا ثبت‌نام کرده اند قرار می‌گیرد؟\n',
                answer:
                    'به روز رسانی‌های هر دوره آموزشی به رایگان در اختیار فراگیرانی که قبلا ثبت‌نام کرده اند قرار میگیرد. (اگر دوره به صورت اساسی تغییر کرده باشد ، دوره آموزشی مجزایی محسوب می‌شود و باید مجدد اقدام به ثبت‌نام کرد، اما همچنان دسترسی به دوره ثبت‌نام شده قبلی فراهم خواهد بود)'
             },
            {
                id: 4,
                question: 'آیا امکان ارتباط با مدرسین دوره‌ها وجود دارد؟',
                answer: 'بله ، شما می‌توانید از طریق گروه‌های پشتیبانی با مدرس یا دستیار آموزشی در ارتباط باشید.'
            },
            {
                id: 5,
                question: 'آیا امکان دریافت دوره آموزشی به صورت سی دی یا فلش وجود دارد؟',
                answer: 'خیر. در حالا حاضر این امکان وجود ندارد.\n'
            },
        ],
    },
    {
        id: 4,
        titleId: 'questions.questionPaths.item4',
        faq: [
            {
                id: 1,
                question:' اگر در دوره‌ای ثبت‌نام کنم ، گواهینامه دریافت خواهم کرد؟',
                answer: 'دوره‌های "خودآموز" حاوی گواهینامه نیستند، اگر دوره "گواهینامه‌دار" تهیه کرده‌اید و در پایان مدت پشتیبانی پروژه دوره را تحویل دهید و امتیاز قبولی دریافت کنید ، گواهینامه دانشگاه صادر خواهد شد.'
              },
            {
                id: 2,
                question: ' اعتبار گواهینامه به چه صورت است؟',
                answer: '\tاین گواهینامه یک گواهی دوره کوتاه مدت محسوب می‌شود و معادل مدرک کارشناسی یا کارشناسی ارشد نیست.'
            },
            {
                id: 3,
                question: 'صحت سنجی گواهینامه صادر شده به چه صورت است؟',
                answer:
                 'هر گواهینامه حاوی یک کد اختصاصی برای فراگیر است، که از وبسایت دانشگاه صنعتی امیرکبیر (پلی تکنیک تهران) قابلیت صحت سنجی دارد.'
             },
            {
                id: 4,
                question: 'گواهینامه صادر شده قابلیت ترجمه دارد؟',
                answer:
                    'گواهینامه‌های صادر شده به زبان انگلیسی است و بدون نیاز به ترجمه قابل استناد در کشورهای دیگر هست.'
            },
            {
                id: 5,
                question:' آیا برای دریافت گواهینامه باید هزینه جدا پرداخت شود؟',
                answer: 'خیر . اگر دوره "گواهینامه‌دار" تهیه کرده‌اید نیازی به پرداخت هزینه جدا برای صدور گواهینامه نیست.'
            },
            {
                id: 6,
                question:' آیا امکان دریافت نسخه چاپی گواهینامه وجود دارد؟',
                answer: 'بله ، هزینه ارسال (پیک یا پست) نسخه فیزیکی بر عهده فراگیر است.'
            },
            {
                id: 7,
                question:' برای دریافت گواهینامه محدودیت زمانی وجود دارد؟',
                answer: 'تا پایان فرصت پشتیبانی می‌بایست پروژه و تمرینات توسط فراگیر جهت ارزیابی در اختیار آموزال قرار داده شود. در غیر اینصورت گواهینامه صادر نخواهد شد ، مگر اینکه مجدد دوره را تمدید نماید. (شرایط تمدید را مطالعه کنید)'
            },
            {
                id: 8,
                question:'منظور از تمدید دوره آموزشی چیست؟',
                answer: 'اگر فراگیری در مدت پشتیبانی تمرینات و پروژه را جهت ارزیابی در اختیار آموزال قرار ندهد و یا امتیاز قبولی دریافت نکند ، با پرداخت هزینه‌ای جهت "تمدید" می‌تواند برای یک دوره 3 ماهه پشتیبانی و فرصت ارزیابی را تمدید نماید. برای هماهنگی با پشتیبانی آموزال تماس بگیرید. '
            },
            {
                id: 9,
                question:'من دوره ای را بلدم ، آیا می‌توانم بدون تهیه دوره آموزشی برای دریافت گواهینامه اقدام کنم؟',
                answer: 'خیر ، ارائه گواهینامه منوط به سپری کردن دوره و محتوای آموزال و قبولی در ارزیابی نهایی است.'
            },
        ],
    },
    {
        id: 5,
        titleId: 'questions.questionPaths.item5',
        faq: [
            {
                id: 1,
                question: 'ارزیابی به صورت امتحان حضوریست؟',
                answer: 'خیر ، پروژه فراگیران ازطریق سایت یا ایمیل دریافت و ارزیابی می‌شود.'
            },
            {
                id: 2,
                question: ' امتیاز لازم برای دریافت گواهینامه چه قدر است؟',
                answer: 'امتیاز دوره ها از 100 محاسبه می‌شود، و حداقل امتیاز قبولی 75 است.'
            },
            {
                id: 3,
                question: 'ارزیابی برای دریافت گواهینامه به چه صورت است؟',
                answer: 'نوع ارزیابی بسته به دوره آموزشی شما متفاوت است. معمولا پروژه‌ای تعریف می‌شود که در پایان دوره پشتیبانی باید به آموزال جهت ارزیابی تحویل شود.'
            },
        ],
    },
    {
        id: 6,
        titleId: 'questions.questionPaths.item6',
        faq: [
            {
                id: 1,
                question: ' آیا همه فراگیران پشتیبانی آموزشی خواهند داشت؟',
                answer: 'فراگیرانی که دوره‌های "گواهینامه‌دار" را تهیه کنند ، پشتیبانی خواهند داشت. (دوره‌های "خودآموز" پشتیبانی ندارند)'
            },
            {
                id: 2,
                question: ' اگر سوالی داشتیم به چه صورت می‌توانیم از مدرس بپرسیم؟',
                answer: 'فراگیرانی که دوره های "گواهینامه‌دار" را تهیه کنند ، عضو گروه‌هایی خواهند شد که مدرس و دستیار آموزشی در این گروه‌ها حضور دارند و پاسخگوی سوالات خواهند بود.'
            },
            {
                id: 3,
                question: 'مدت پشتیبانی چقدر است؟',
                answer: 'بسته به دوره آموزشی متفاوت است، اما به صورت معمول  پشتیبانی مجازی 3 ماه ادامه دارد.'
            },
            {
                id: 4,
                question: 'اگر در مشاهده دوره به مشکلی برخوردم چطور باید مطرح کنم ؟',
                answer: 'با شماره واتسپ پشتیبانی آموزال در میان بگذارید و مورد شما در اولین فرصت بررسی و رفع خواهد شد. 09907892990'
            },

        ],
    },
];
