export const mockSlideShows = [
    {
        image: '/static/images/mock-top-teacher.png',
        title: '!یادگیری راحت‌تر از همیشه',
        description:
            'لورم ایپسوم یا طرح‌نما به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته چگونگی نوع و اندازه فونت و ظاهر متن باشد.',
        url: '#',
    },
    {
        image: '/static/images/mock-top-teacher.png',
        title: '!یادگیری راحت‌تر از همیشه',
        description:
            'لورم ایپسوم یا طرح‌نما به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته چگونگی نوع و اندازه فونت و ظاهر متن باشد.',
        url: '#',
    },
    {
        image: '/static/images/mock-top-teacher.png',
        title: '!یادگیری راحت‌تر از همیشه',
        description:
            'لورم ایپسوم یا طرح‌نما به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته چگونگی نوع و اندازه فونت و ظاهر متن باشد.',
        url: '#',
    },
];
